#第一个程序，输入数字。
print("让我们来玩一场数字游戏吧！")
print("游戏开始!")
numbers=float(input("请输入10以内你喜欢的数字："))
if numbers==1:
    print("1呀，1呀，咿呀咿呀哟~~~~，哈哈🙂")
if numbers==2:
        print("222,喜欢2的话，你就是个2逼呀，略略略略~~")
if numbers==3:
    print("333,你家坐在山沟沟，山上有棵杉木树，嘻嘻嘻~~~~😀😀😀")
if numbers==4:
    print("444，都4你的错。骗你的啦我的宝，有什么错让我来吧嗯~ o(*￣▽￣*)o。")
if numbers==5:
        print("555,我好害怕你会呜呜呜呜~~~，我相信你不会的。")
if numbers==6:
         print("666,6个屁，你就是个大猪头啦~🐷🐷🐷")
if numbers==7:
    print("777，大傻逼大傻逼大傻逼，气不气啊U•ェ•*U~")
if numbers==8:
    print("8啦，8啦，8~~啦8")
if numbers==9:
    print("999,啾啾~~啾啾啾~jiu。乌拉~~~")
if numbers==10:
    print("十全十美，说的就是你啊，你信吗？🤗🤗🤗")
if numbers==0:
    print("  ❤❤❤❤❤❤❤❤❤      ❤❤                   ❤❤    ❤               ❤❤❤❤❤❤❤❤             ")
    print("  ❤❤❤❤❤❤❤❤❤      ❤❤      ❤            ❤❤  ❤                      ❤                   ")
    print("             ❤❤      ❤❤     ❤              ❤❤❤❤❤❤❤                ❤                    ")
    print("             ❤❤      ❤❤    ❤                    ❤ ❤           ❤❤❤❤❤❤❤❤❤❤            ")
    print("   ❤❤❤❤❤❤❤❤       ❤❤   ❤                   ❤ ❤             ❤            ❤             ")
    print("   ❤❤❤❤❤❤❤❤       ❤❤  ❤                  ❤   ❤             ❤            ❤             ")
    print("   ❤❤      ❤❤❤❤❤❤❤❤❤❤❤❤               ❤❤❤❤❤❤❤❤        ❤      ❤     ❤            ")
    print("   ❤❤       ❤❤❤❤❤❤❤❤❤❤❤                    ❤ ❤ ❤          ❤     ❤     ❤             ")
    print("   ❤❤❤❤❤❤❤❤       ❤❤ ❤                     ❤  ❤    ❤       ❤     ❤     ❤             ")
    print("            ❤❤        ❤❤   ❤                 ❤    ❤      ❤     ❤     ❤     ❤             ")
    print("            ❤❤        ❤❤    ❤               ❤     ❤       ❤    ❤     ❤     ❤             ")
    print("            ❤❤        ❤❤     ❤             ❤      ❤        ❤   ❤     ❤❤    ❤            ")
    print("   ❤❤❤❤❤❤❤❤        ❤❤       ❤          ❤       ❤         ❤        ❤   ❤               ")
    print("   ❤❤❤❤❤❤❤❤        ❤❤         ❤       ❤        ❤          ❤      ❤       ❤❤❤         ")
if numbers>10:
    print("系统报错！")
#第一个程序结束

#第二个程序开始
